Tekla Open API Reference for Tekla Structures 2025
WindowBase.GetUnitDecimals Method
 Gets the number of decimals Tekla Structures uses with the specified unit type.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int GetUnitDecimals(
	dotdiaUnitTypes_e unit
)
Public Shared Function GetUnitDecimals (
	unit As dotdiaUnitTypes_e
) As Integer
Parameters
unit
Type: Tekla.Structures.Dialog.dotdiaUnitTypes_e
The specified unit type.
Return Value
Type: Int32
The number of decimals used, 0 (no decimals or invalid unit type) or -1 (failed).
See Also
Reference
WindowBase Class
Tekla.Structures.Dialog Namespace